import './task1.css';
// import elementStr from './elementStr.js';

const elem = require('./elementStr.js').default;

console.log(elem);
// Дано рядок; потрібно написати функцію,
// яка дозволяє повернути значення true,
// якщо рядок є паліндромом, і false - якщо ні.
// При цьому потрібно враховувати прогалини та розділові знаки.

// Паліндром
// Паліндром - слово, речення чи послідовність
// символів, яка абсолютно однаково читається як
// у звичному напрямку, так і у зворотному.
// Наприклад, "Anna" - це паліндром, а "table" і "John" - ні.

console.log(elem('Anna'));
